app/controllers/account_memberships_controller.rb

SELECT * FROM `account_memberships` WHERE (`account_memberships`.account_id = 2) AND (person_id = 2) LIMIT 1
---
  def show
    @account_membership = AccountMembership.find(params[:id])