app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts` INNER JOIN account_memberships ON accounts.id = account_memberships.account_id WHERE (`accounts`.`id` = 2 AND ((`account_memberships`.person_id = 1)))
---
  def show
    @account = current_person.accounts.find(params[:id])