app/controllers/items_controller.rb

  def index
    @account = params[:account_id] ? current_person.accounts.find(params[:account_id]) : current_person.default_account
---
SELECT `accounts`.* FROM `accounts` INNER JOIN account_memberships ON accounts.id = account_memberships.account_id WHERE (`accounts`.`id` = 2 AND ((`account_memberships`.person_id = 1)))

  def create
    @account = current_person.accounts.find params[:account_id]
    @account_membership = @account.account_memberships.find params[:account_membership_id]
    item_type = params[:item].delete(:type)
    @item = @account_membership.items.new(params[:item]).becomes(Object.const_get(item_type))
    raise 'tried to create a non-item object from an item.  this might be an attack' unless @item.is_a?(Item)
    @item.type = item_type
    respond_to do |format|
      if @item.save
---
SELECT `accounts`.* FROM `accounts` INNER JOIN account_memberships ON accounts.id = account_memberships.account_id WHERE (`accounts`.`id` = 2 AND ((`account_memberships`.person_id = 1)))
SELECT * FROM `account_memberships` WHERE (`account_memberships`.`id` = 2 AND (`account_memberships`.account_id = 2))
INSERT INTO `items` (`updated_by_id`, `created_at`, `created_by_id`, `updated_at`, `text`, `type`, `account_membership_id`, `for`) VALUES(NULL, '2008-12-17 18:44:52', 1, '2008-12-17 18:44:52', 'worked with @brian ', 'Deed', 2, '2008-12-16')